JosAlc67/DimecaProject/esp32_triple_as5600/Fase7_Integracion_Final/Fase7_Integracion_Final.ino
const uint32_t PWM_FREQ_HZ    = 20000;
const uint8_t  PWM_RES_BITS   = 8;
// 60 (~23%) resulto insuficiente para vencer la friccion estatica de los
// motores (no arrancaban). 255 (100%) si arranco, confirmado en pruebas,
// pero no se quiere dejar al maximo como velocidad "baja" por defecto.
// 150 (~59%) es un valor intermedio SIN VALIDAR EN HARDWARE todavia:
// confirma que los 3 motores arrancan con este valor, o ajustalo.
const uint8_t  VELOCIDAD_BAJA = 150;

const uint8_t PIN_RPWM[3] = {25, 27, 19};
const uint8_t PIN_LPWM[3] = {26, 18, 23};

#if !CORE_LEDC_V3
const uint8_t CANAL_RPWM[3] = {0, 2, 4};
const uint8_t CANAL_LPWM[3] = {1, 3, 5};
#endif

enum EstadoMotor { PARADO, ADELANTE, REVERSA };
EstadoMotor estadoMotor[3] = {PARADO, PARADO, PARADO};
uint8_t motorActivo = 0;

void configurarPWM(uint8_t pin, uint8_t canal) {
#if CORE_LEDC_V3
  ledcAttach(pin, PWM_FREQ_HZ, PWM_RES_BITS);
#else
  ledcSetup(canal, PWM_FREQ_HZ, PWM_RES_BITS);
  ledcAttachPin(pin, canal);
#endif
}

void escribirPWM(uint8_t pin, uint8_t canal, uint32_t duty) {
#if CORE_LEDC_V3
  ledcWrite(pin, duty);
#else
  ledcWrite(canal, duty);
#endif
}

uint8_t canalRPWM(uint8_t m) {
#if CORE_LEDC_V3
  return 0;
#else
  return CANAL_RPWM[m];
#endif
}
uint8_t canalLPWM(uint8_t m) {
#if CORE_LEDC_V3
  return 0;
#else
  return CANAL_LPWM[m];
#endif
}

// Posicion acumulada RAW (sin convertir a grados) del encoder emparejado
// con el motor `m` (mapeo confirmado 1-1, 2-2, 3-3).
int32_t leerPosicionAcumRaw(uint8_t m) {
  switch (m) {
    case 0: return as5600_1.getCumulativePosition(false);
    case 1: return as5600_2.getCumulativePosition(false);
    case 2: return posicionAcum3;
    default: return 0;
  }
}

// Guarda en flash la posicion acumulada actual del encoder del motor `m`,
// para poder restaurarla en el proximo arranque (ver setup()).
void guardarPosicionMotor(uint8_t m) {
  guardarPosicionAcum(m + 1, leerPosicionAcumRaw(m));
}

void detenerMotor(uint8_t m) {
  escribirPWM(PIN_RPWM[m], canalRPWM(m), 0);
  escribirPWM(PIN_LPWM[m], canalLPWM(m), 0);
  estadoMotor[m] = PARADO;
  guardarPosicionMotor(m);
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.println(": DETENIDO");
}

void girarAdelante(uint8_t m) {
  if (estadoMotor[m] != PARADO) {
    Serial.println("RECHAZADO: detén el motor (S) antes de cambiar de sentido.");
    return;
  }
  escribirPWM(PIN_LPWM[m], canalLPWM(m), 0);
  escribirPWM(PIN_RPWM[m], canalRPWM(m), VELOCIDAD_BAJA);
  estadoMotor[m] = ADELANTE;
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.println(": GIRANDO ADELANTE (baja velocidad)");
}

void girarReversa(uint8_t m) {
  if (estadoMotor[m] != PARADO) {
    Serial.println("RECHAZADO: detén el motor (S) antes de cambiar de sentido.");
    return;
  }
  escribirPWM(PIN_RPWM[m], canalRPWM(m), 0);
  escribirPWM(PIN_LPWM[m], canalLPWM(m), VELOCIDAD_BAJA);
  estadoMotor[m] = REVERSA;
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.println(": GIRANDO REVERSA (baja velocidad)");
}

// ---------------- HOME (regreso a 0) - lazo cerrado simple, SIN PID ----------------
//
// Regla fija para los 3 motores, confirmada en hardware: F (adelante)
// RESTA del acumulado y R (reversa) SUMA. Por lo tanto, para volver a 0:
// si el acumulado es NEGATIVO se manda REVERSA (R, que suma y lo acerca
// a 0); si es POSITIVO se manda ADELANTE (F, que resta y lo acerca a 0).
// Se detiene al llegar dentro de la tolerancia. No hay ganancias ni
// ajuste fino de velocidad - es control bang-bang, el mas simple posible.
//
// Mapeo motor->encoder confirmado por el usuario: 1-1, 2-2, 3-3 (sin cruces).
//
// Se mantiene una sola proteccion: si no mejora el error en
// HOMING_MARGEN_PROGRESO_MS, o si se excede HOMING_TIMEOUT_MS en total,
// aborta y detiene el motor - con la regla fija, si esto pasa es señal de
// un problema real (encoder desacoplado, motor sin fuerza, etc.), no de
// un signo mal elegido.

const float    TOLERANCIA_HOMING_DEG     = 3.0f;   // se considera "en home" dentro de esto
const uint32_t HOMING_TIMEOUT_MS         = 20000;  // aborta si tarda mas de esto en total
const uint32_t HOMING_MARGEN_PROGRESO_MS = 4000;   // debe mejorar el error en este tiempo

bool homingActivo[3]         = {false, false, false};
uint32_t homingInicio[3]     = {0, 0, 0};
uint32_t homingUltimoProgreso[3] = {0, 0, 0};
float homingMejorError[3]    = {0, 0, 0};

// Lee la posicion acumulada (continua, sin wraparound) en grados del
// encoder correspondiente al motor `m` (0, 1 o 2).
// Mapeo fisico confirmado por el usuario: cada AS5600 esta emparejado con
// su motor del mismo numero (1-1, 2-2, 3-3), sin cruces.
bool leerAnguloAcumuladoGrados(uint8_t m, float &grados) {
  int32_t posRaw;
  bool ok;
  switch (m) {
    case 0: ok = comOk1; posRaw = as5600_1.getCumulativePosition(false); break; // Motor 1 -> AS5600 #1
    case 1: ok = comOk2; posRaw = as5600_2.getCumulativePosition(false); break; // Motor 2 -> AS5600 #2
    case 2: ok = comOk3; posRaw = posicionAcum3; break;                        // Motor 3 -> AS5600 #3
    default: return false;
  }
  if (!ok) return false;
  grados = posRaw * (360.0f / 4096.0f);
  return true;
}

void detenerHoming(uint8_t m, const char *motivo) {
  homingActivo[m] = false;
  detenerMotor(m);
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.print(": HOME ");
  Serial.println(motivo);
}

void iniciarHoming(uint8_t m) {
  if (estadoMotor[m] != PARADO) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": RECHAZADO - detenlo (S) antes de iniciar HOME.");
    return;
  }
  float grados;
  bool ok = leerAnguloAcumuladoGrados(m, grados);
  if (!ok) {
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.println(": RECHAZADO - encoder sin comunicacion, no se puede iniciar HOME.");
    return;
  }
  homingActivo[m] = true;
  homingInicio[m] = millis();
  homingUltimoProgreso[m] = millis();
  homingMejorError[m] = fabs(grados);
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.print(": iniciando HOME desde ");
  Serial.print(grados, 2);
  Serial.println(" deg...");
}

// Se llama en CADA iteracion de loop() para los motores con homing activo.
void actualizarHoming(uint8_t m) {
  if (!homingActivo[m]) return;

  float grados;
  if (!leerAnguloAcumuladoGrados(m, grados)) {
    detenerHoming(m, "ABORTADO - se perdio comunicacion con el encoder.");
    return;
  }

  float errorAbs = fabs(grados);

  if (errorAbs <= TOLERANCIA_HOMING_DEG) {
    homingActivo[m] = false;
    detenerMotor(m);
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.print(": HOME alcanzado, posicion final = ");
    Serial.print(grados, 2);
    Serial.println(" deg.");
    return;
  }

  if (millis() - homingInicio[m] > HOMING_TIMEOUT_MS) {
    detenerHoming(m, "ABORTADO - tiempo limite excedido.");
    return;
  }

  if (errorAbs < homingMejorError[m] - 0.5f) {
    homingMejorError[m] = errorAbs;
    homingUltimoProgreso[m] = millis();
  } else if (millis() - homingUltimoProgreso[m] > HOMING_MARGEN_PROGRESO_MS) {
    detenerHoming(m, "ABORTADO - no se acerca a 0. Revisa el encoder/acople mecanico.");
    return;
  }

  // Regla fija: negativo -> reversa (R, suma), positivo -> adelante (F, resta).
  bool debeIrAdelante = (grados > 0);
  EstadoMotor direccionDeseada = debeIrAdelante ? ADELANTE : REVERSA;

  if (estadoMotor[m] != direccionDeseada) {
    if (estadoMotor[m] != PARADO) detenerMotor(m);
    if (debeIrAdelante) girarAdelante(m);
    else girarReversa(m);
  }
}

// Imprime el estado de los 3 encoders bajo demanda (comando STATUS), en vez
// de hacerlo automaticamente cada cierto tiempo - eso generaba demasiado
// ruido visual en el Monitor Serial.
void imprimirEstadoCompleto() {
  bool imanOk1 = comOk1 && as5600_1.magnetDetected();
  bool imanOk2 = comOk2 && as5600_2.magnetDetected();
  uint8_t st3 = 0;
  bool imanOk3 = comOk3 && leerReg8_bus3(AS5600_REG_STATUS, st3) && (st3 & AS5600_STATUS_MD);

  imprimirPosicion("AS5600 #1", comOk1, as5600_1.getCumulativePosition(false), as5600_1.getRevolutions(), imanOk1);
  imprimirPosicion("AS5600 #2", comOk2, as5600_2.getCumulativePosition(false), as5600_2.getRevolutions(), imanOk2);
  imprimirPosicion("AS5600 #3", comOk3, posicionAcum3, revoluciones3(), imanOk3);
  Serial.println("---");
}

void procesarComando(String cmd) {
  cmd.trim();
  cmd.toUpperCase();

  if (cmd == "M1") { motorActivo = 0; Serial.println("Motor activo: 1"); }
  else if (cmd == "M2") { motorActivo = 1; Serial.println("Motor activo: 2"); }
  else if (cmd == "M3") { motorActivo = 2; Serial.println("Motor activo: 3"); }
  else if (cmd == "F") girarAdelante(motorActivo);
  else if (cmd == "R") girarReversa(motorActivo);
  else if (cmd == "S") { homingActivo[motorActivo] = false; detenerMotor(motorActivo); }
  else if (cmd == "SS") {
    for (uint8_t i = 0; i < 3; i++) { homingActivo[i] = false; detenerMotor(i); }
    Serial.println("PARADA DE EMERGENCIA: los 3 motores detenidos.");
  }
  else if (cmd == "CAL1") calibrarSensor(1);
  else if (cmd == "CAL2") calibrarSensor(2);
  else if (cmd == "CAL3") calibrarSensor(3);
  else if (cmd == "HOME1") iniciarHoming(0);
  else if (cmd == "HOME2") iniciarHoming(1);
  else if (cmd == "HOME3") iniciarHoming(2);
  else if (cmd == "HOME") {
    for (uint8_t i = 0; i < 3; i++) iniciarHoming(i);
  }
  else if (cmd == "STATUS") imprimirEstadoCompleto();
  else if (cmd.length() > 0) {
    Serial.println("Comando no reconocido. Usa: M1 M2 M3 F R S SS CAL1 CAL2 CAL3 HOME1 HOME2 HOME3 HOME STATUS");
  }
}

// ---------------- Programa principal ----------------

const uint32_t CHECKPOINT_INTERVALO_MS = 60000; // respaldo de posicion cada 60s
uint32_t ultimoCheckpoint = 0;

void setup() {
  Serial.begin(115200);
  delay(500);
  Serial.println();
  Serial.println("=== Fase 7: integracion final (3 AS5600 + 3 BTS7960, sin PID) ===");

  Wire.begin(21, 22);
  Wire.setClock(400000);
  Serial.println(as5600_1.begin() ? "OK: AS5600 #1" : "ERROR: AS5600 #1 no responde al iniciar");

  Wire1.begin(32, 33);
  Wire1.setClock(400000);
  Serial.println(as5600_2.begin() ? "OK: AS5600 #2" : "ERROR: AS5600 #2 no responde al iniciar");

  i2c3.begin(4, 13, 100000);
  uint16_t rawTest;
  bool imanTest;
  Serial.println(leerAS5600_3(rawTest, imanTest) ? "OK: AS5600 #3" : "ERROR: AS5600 #3 no responde al iniciar");

  // Restaura offsets de calibracion guardados en flash (si existen).
  int16_t off1 = cargarOffsetRaw(1);
  int16_t off2 = cargarOffsetRaw(2);
  offsetRaw3    = cargarOffsetRaw(3);
  as5600_1.setOffset(off1 * AS5600_RAW_TO_DEGREES);
  as5600_2.setOffset(off2 * AS5600_RAW_TO_DEGREES);
  Serial.print("Offsets cargados de flash -> #1: ");
  Serial.print(off1);
  Serial.print(" | #2: ");
  Serial.print(off2);
  Serial.print(" | #3: ");
  Serial.println(offsetRaw3);

  // Restaura la posicion acumulada guardada en flash (si existe) en vez de
  // reiniciar siempre en 0, para que "0" siga siendo el mismo punto fisico
  // entre reinicios/apagados. Esto asume que el eje no se movio a mano
  // mientras el ESP32 estaba apagado (el AS5600 es un sensor relativo para
  // el conteo de vueltas, no puede detectar movimiento sin alimentacion).
  // resetCumulativePosition()/resetPosicionAcumulada3() tambien resincronizan
  // la referencia interna con la posicion FISICA real actual, evitando que
  // la primera lectura interprete un salto falso.
  int32_t pos1 = cargarPosicionAcum(1);
  int32_t pos2 = cargarPosicionAcum(2);
  int32_t pos3 = cargarPosicionAcum(3);
  as5600_1.resetCumulativePosition(pos1);
  as5600_2.resetCumulativePosition(pos2);
  resetPosicionAcumulada3(pos3);
  Serial.print("Posicion restaurada de flash (cuentas RAW) -> #1: ");
  Serial.print(pos1);
  Serial.print(" | #2: ");
  Serial.print(pos2);
  Serial.print(" | #3: ");
  Serial.println(pos3);

  for (uint8_t i = 0; i < 3; i++) {
#if CORE_LEDC_V3
    configurarPWM(PIN_RPWM[i], 0);
    configurarPWM(PIN_LPWM[i], 0);
#else
    configurarPWM(PIN_RPWM[i], CANAL_RPWM[i]);
    configurarPWM(PIN_LPWM[i], CANAL_LPWM[i]);
#endif
    detenerMotor(i); // arranca siempre detenido
  }

  Serial.println();
  Serial.println("Comandos: M1 M2 M3 (seleccionar motor) | F (adelante) | R (reversa) | S (detener) | SS (parada de emergencia)");
  Serial.println("Calibracion: CAL1 CAL2 CAL3 -> fija 0 deg en la posicion fisica actual de ese eje (persiste en flash)");
  Serial.println("HOME: HOME1 HOME2 HOME3 (un motor) | HOME (los 3 a la vez) -> regreso a 0 en lazo cerrado, sin PID");
  Serial.println("STATUS -> imprime el angulo/vueltas de los 3 encoders (ya no se imprime solo, para no saturar el Monitor Serial)");
  Serial.println("Motor activo por defecto: 1.");
  Serial.println();

  ultimoCheckpoint = millis();
}

void loop() {
  if (Serial.available()) {
    String linea = Serial.readStringUntil('\n');
    procesarComando(linea);
  }

  // Actualizacion RAPIDA del conteo de vueltas: se hace en cada iteracion
  // de loop(), no solo cuando toca imprimir, porque si el eje gira mas de
  // media vuelta entre dos actualizaciones el algoritmo pierde la cuenta.
  as5600_1.getCumulativePosition(true);
  comOk1 = (as5600_1.lastError() == 0);

  as5600_2.getCumulativePosition(true);
  comOk2 = (as5600_2.lastError() == 0);

  comOk3 = actualizarPosicion3();

  // Avanza el homing (si esta activo) de cada motor, tambien en cada
  // iteracion de loop() para reaccionar rapido si hay que abortar.
  actualizarHoming(0);
  actualizarHoming(1);
  actualizarHoming(2);

  // Respaldo periodico en flash, por si el ESP32 pierde alimentacion
  // mientras un motor sigue en movimiento (detenerMotor() ya guarda al
  // detenerse, esto es solo la red de seguridad para ese caso puntual).
  uint32_t ahora = millis();
  if (ahora - ultimoCheckpoint >= CHECKPOINT_INTERVALO_MS) {
    ultimoCheckpoint = ahora;
    for (uint8_t i = 0; i < 3; i++) guardarPosicionMotor(i);
  }
}
